FKDD_COPY_DIFF_3_2026-02-13/AccumulationRegisters/БТ_ЗаявкаНаРасходДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>БТ_ЗаявкаНаРасходДС</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаРасходДС</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/БТ_СтатусыЗаявокПоСтрокам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>БТ_СтатусыЗаявокПоСтрокам</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.БТ_СтатусыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:EnumRef.БТ_РолиАдресатовЗаявок</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRoutePointRef.БТ_УтвержденияЗаявок</v8:Type>
						<v8:Type>cfg:BusinessProcessRoutePointRef.БТ_СогласованиеЗаявокДДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Согласующий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТочкаМаршрутаИзменения</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRoutePointRef.БТ_УтвержденияЗаявок</v8:Type>
						<v8:Type>cfg:BusinessProcessRoutePointRef.БТ_СогласованиеЗаявокДДС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаявкаПользователя</Name>
					<Type>
						<v8:Type>cfg:BusinessProcessRef.БТ_СогласованиеЗаявокДДС</v8:Type>
						<v8:Type>cfg:BusinessProcessRef.БТ_УтвержденияЗаявок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/БТ_СтатьиДДСИсключения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>БТ_СтатьиДДСИсключения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>СтатьяДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/AccumulationRegisters/БТ_ПланДДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>БТ_ПланДДС</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДДС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДДС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/БТ_КонстантныеЗначения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>БТ_КонстантныеЗначения</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<Comment>В регистре хранятся значения дополнительных свойств объектов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>Значение свойства</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект (справочник или документ) для которого существуют и могут быть назначены дополнительные свойства</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.НазначенияСвойствОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>Вид свойства</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Enums/БТ_СтатусыЗаявки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>БТ_СтатусыЗаявки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подготовлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утверждена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплачено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленоНаДоработку</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Enums/СтатусыПартий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыПартий</Name>
			<Comment>Статусы партий</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТоварКупленный</Name>
					<Comment>Товар (купленный)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварПринятыйКомиссия</Name>
					<Comment>Товар (принятый на комиссию)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварОтветственноеХранение</Name>
					<Comment>Товар (ответственное хранение)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/Catalogs/ПодразделенияКомпании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ПодразделенияКомпании</Name>
			<Comment>Подразделения компании</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Организация, к которой относится подразделение</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Префикс</Name>
					<Comment>Префикс автонумерации для документов (до 3-х букв)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Comment>Код причины постановки на учет</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрафикРаботы</Name>
					<Comment>График работы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрафикиРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстановкаЦенДокументамиПоступления</Name>
					<Comment>Установка цен документами поступления</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьЗакупочнуюЦену</Name>
					<Comment>Формировать закупочную цену</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьНормативнуюЦену</Name>
					<Comment>Формировать нормативную цену</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереоценкаРозницаПоПриходу</Name>
					<Comment>Переоценивать розничные остатки при оприходовании товаров</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПереоценкаРозницаПоРасходу</Name>
					<Comment>Переоценивать розничные остатки при списании товаров</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Балансовое</Name>
					<Comment>Признак того, что подразделение является балансовым</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Comment>Основная валюта подразделения. Подставляется по умолчанию в новые документы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Comment>Основной банковский счет организации</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйЗаТД</Name>
					<Comment>Ответственный за тест-драйв</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНалога</Name>
					<Comment>Вид налога</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНалогов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсвобожденОтНДС</Name>
					<Comment>Если флажок установлен, то при заполнении приходных документов от этого подразделения, товары будут поступать без НДС</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>тт_НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.тт_НаправлениеДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БТ_НазваниеДляССП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БТ_ПодразделениеКМ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БТ_ПодразделенияКМ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БТ_ВключитьРезервированиеПоЗаявкеНаРемонт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БТ_ПодразделениеССП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БТ_ПодразделенияССП</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/CommonModules/БТ_ПодпискаНаСобытие/Ext/Module.bsl
Процедура БТ_ПриЗаписиПриЗаписи(Источник, Отказ) Экспорт

	//->Diginova _Настройка базы_ 03.01.2022
	Если Источник.ОбменДанными.Загрузка = Истина тогда
		Возврат;
	КонецЕсли;
//{{MRG[ <-> ]
	//<-Diginova _FlaiM_  
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//	//<-Diginova _FlaiM_
//}}MRG[ <-> ]
	
	//=>Diginova 18.01.22
	Если НЕ Источник.Метаданные().Реквизиты.Найти("ВнешнийОбъект") = Неопределено тогда
		Возврат;
	КонецЕсли;   
	//<= Diginova
	
	//<<БАА
	Подразделение = Справочники.ПодразделенияКомпании.ПустаяСсылка();
	Попытка      
		Подразделение = Источник.ПодразделениеКомпании;
	Исключение
		Попытка      
			Подразделение = Источник.Подразделение;
			Если ТипЗнч(Подразделение) = Тип("Строка") Тогда
				Подразделение = НайтиПодразделениеССП(Подразделение);
			КонецЕсли;	
		Исключение
			ЗаписьЖурналаРегистрации("РасчетССП.ДокументБезПодразделения",УровеньЖурналаРегистрации.Информация,,, Источник);
		КонецПопытки;	
	КонецПопытки;	
	
//{{MRG[ <-> ]
	Попытка
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//	Попытка    
//}}MRG[ <-> ]
		ДатаСсылки = НачалоДня(Источник.Дата);
		Организация = Источник.организация;
		ИмяДокумента = Источник.Метаданные().Имя;
		
//{{MRG[ <-> ]
			//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
		// Данный фрагмент построен конструктором.
		// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//		ДатаСсылки 		= НачалоДня(Источник.Дата);
//		Организация 	= Источник.организация;
//		ИмяДокумента 	= Источник.Метаданные().Имя;
//}}MRG[ <-> ]
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	БТ_ИзменениеМетаданных.Метаданные КАК Метаданные,
			|	БТ_ИзменениеМетаданных.Учтено КАК Учтено,
			|	БТ_ИзменениеМетаданных.ДатаИзменения КАК ДатаИзменения,
			|	БТ_ИзменениеМетаданных.Организация КАК Организация
			|ИЗ
			|	РегистрСведений.БТ_ИзменениеМетаданных КАК БТ_ИзменениеМетаданных
			|ГДЕ
			|	БТ_ИзменениеМетаданных.Метаданные = &Метаданные
			|	И БТ_ИзменениеМетаданных.ДатаИзменения < &ДатаИзменения
			|	И НЕ БТ_ИзменениеМетаданных.Учтено
			|	И БТ_ИзменениеМетаданных.Организация = &Организация
			|	И БТ_ИзменениеМетаданных.Подразделение = &Подразделение";
		
//{{MRG[ <-> ]
		Запрос.УстановитьПараметр("ДатаИзменения", ДатаСсылки);
		Запрос.УстановитьПараметр("Метаданные", ИмяДокумента);
		Запрос.УстановитьПараметр("Организация", Организация);
		Запрос.УстановитьПараметр("Подразделение", Подразделение);
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//		Запрос.УстановитьПараметр("ДатаИзменения",	ДатаСсылки);
//		Запрос.УстановитьПараметр("Метаданные", 	ИмяДокумента);
//		Запрос.УстановитьПараметр("Организация", 	Организация);
//}}MRG[ <-> ]
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			
			МенеджерЗаписи = РегистрыСведений.БТ_ИзменениеМетаданных.СоздатьМенеджерЗаписи();
//{{MRG[ <-> ]
			МенеджерЗаписи.ДатаИзменения = ДатаСсылки;
			МенеджерЗаписи.Метаданные	= ИмяДокумента;
			МенеджерЗаписи.Организация	= Организация;
			МенеджерЗаписи.Подразделение	= Подразделение;
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//			МенеджерЗаписи.ДатаИзменения 	= ДатаСсылки;
//			МенеджерЗаписи.Метаданные		= ИмяДокумента;
//			МенеджерЗаписи.Организация		= Организация;
//}}MRG[ <-> ]
			МенеджерЗаписи.Записать();
			
//{{MRG[ <-> ]
		КонецЕсли;
	Исключение
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//		КонецЕсли; 
//		
//}}MRG[ <-> ]
//{{MRG[ <-> ]
//	Исключение     
//		
//}}MRG[ <-> ]
	КонецПопытки;
	
КонецПроцедуры  

Функция НайтиПодразделениеССП(Подразделение)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПодразделенияКомпании.Ссылка КАК Ссылка
	                      |ИЗ
	                      |	Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
	                      |ГДЕ
	                      |	ПодразделенияКомпании.БТ_НазваниеДляССП = &БТ_НазваниеДляССП");
	Запрос.УстановитьПараметр("БТ_НазваниеДляССП", Подразделение);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли;	
КонецФункции	

Процедура БюджетДДСПроведениеОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	ПланДДС = Источник.Движения.БТ_ПланДДС;
	ПланДДС.Очистить();
	
	Для Каждого ТекСтрокаСтатьиДДС Из Источник.СтатьиДДС Цикл
		
		Движение = ПланДДС.Добавить();
		Движение.Период 				= Источник.ДатаПланирования;
		Движение.Организация 			= Источник.Организация;
		Движение.Сценарий 				= Источник.СценарийПланирования;
		Движение.СтатьяДДС 				= ТекСтрокаСтатьиДДС.СтатьяДДС;
		Движение.Сумма 					= ТекСтрокаСтатьиДДС.БазоваяСуммаУпр;  
		Движение.ПодразделениеКомпании 	= Источник.ПодразделениеКомпании;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура СоздатьНовыйБП(ЗаявкаНаРасходДС);
	
	Заявка = БизнесПроцессы.БТ_СогласованиеЗаявокДДС.СоздатьБизнесПроцесс();
	Заявка.Дата 			= ТекущаяДата();
	Заявка.ЗаявкаНаРасходДС = ЗаявкаНаРасходДС;
	Заявка.Пользователь		= ПараметрыСеанса.Пользователь;
	Заявка.Записать();
	Заявка.Старт();   
	
	РегистрыСведений.БТ_СтатусыЗаявкиДДС.УстановитьСтатус(ЗаявкаНаРасходДС, Перечисления.БТ_СтатусыЗаявки.НаСогласовании);
	
КонецПроцедуры

Функция БылиПодченныеДокументы(ЗаявкаНаРасходДС)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	БТ_ЗаявкаНаРасходДС.Период КАК Период,
		|	NULL КАК Ссылка
		|ИЗ
		|	РегистрНакопления.БТ_ЗаявкаНаРасходДС КАК БТ_ЗаявкаНаРасходДС
		|ГДЕ
		|	БТ_ЗаявкаНаРасходДС.Регистратор <> &ЗаявкаНаРасходДС
		|	И БТ_ЗаявкаНаРасходДС.ЗаявкаНаРасходДС = &ЗаявкаНаРасходДС
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	NULL,
		|	БТ_СогласованиеЗаявокДДС.Ссылка
		|ИЗ
		|	БизнесПроцесс.БТ_СогласованиеЗаявокДДС КАК БТ_СогласованиеЗаявокДДС
		|ГДЕ
		|	БТ_СогласованиеЗаявокДДС.ЗаявкаНаРасходДС = &ЗаявкаНаРасходДС
		|	И НЕ БТ_СогласованиеЗаявокДДС.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("ЗаявкаНаРасходДС", ЗаявкаНаРасходДС);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Возврат не РезультатЗапроса.Пустой();  
	
КонецФункции         

Функция СтатусСотрудникаЦФО(ЗаявкаНаРасходДС) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БТ_СтатусыЗаявокПоСтрокамСрезПоследних.Статус КАК Статус
		|ИЗ
		|	РегистрСведений.БТ_СтатусыЗаявокПоСтрокам.СрезПоследних(, ЗаявкаПользователя.ЗаявкаНаРасходДС = &Ссылка) КАК БТ_СтатусыЗаявокПоСтрокамСрезПоследних";
	
	Запрос.УстановитьПараметр("Ссылка", ЗаявкаНаРасходДС);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ВыборкаДетальныеЗаписи.Статус = Перечисления.БТ_СтатусыЗаявок.УтвержденаСотрудникЦФО Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла; 
	
	Возврат Ложь;

КонецФункции

Функция ПроверитьОстатокПоВыписке(Выписка, дата)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВыпискаСостав.СтатьяДДС КАК СтатьяДДС,
		|	ВыпискаСостав.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		|	ВыпискаСостав.ДокументПланирования КАК ДокументПланирования,
		|	ВыпискаСостав.Ссылка.Организация КАК Организация,
		|	СУММА(ВыпискаСостав.СуммаРасход) КАК СуммаРасход
		|ПОМЕСТИТЬ БанковскаяВыписка
		|ИЗ
		|	Документ.Выписка.Состав КАК ВыпискаСостав
		|ГДЕ
		|	ВыпискаСостав.Ссылка = &Ссылка
		|	И НЕ ВыпискаСостав.СтатьяДДС В
		|				(ВЫБРАТЬ
		|					БТ_СтатьиДДСИсключения.СтатьяДДС КАК СтатьяДДС
		|				ИЗ
		|					РегистрСведений.БТ_СтатьиДДСИсключения КАК БТ_СтатьиДДСИсключения)
		|
		|СГРУППИРОВАТЬ ПО
		|	ВыпискаСостав.ДоговорВзаиморасчетов,
		|	ВыпискаСостав.Ссылка.Организация,
		|	ВыпискаСостав.ДокументПланирования,
		|	ВыпискаСостав.СтатьяДДС
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	БТ_ЗаявкаНаРасходДСОстатки.СуммаОстаток КАК СуммаОстаток,
		|	БанковскаяВыписка.СтатьяДДС КАК СтатьяДДС,
		|	БанковскаяВыписка.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		|	БанковскаяВыписка.ДокументПланирования КАК ДокументПланирования,
		|	БанковскаяВыписка.Организация КАК Организация,
		|	БанковскаяВыписка.СуммаРасход КАК СуммаРасход,
		|	БТ_ЗаявкаНаРасходДСОстатки.СуммаОстаток КАК СуммаОстаток1
		|ИЗ
		|	БанковскаяВыписка КАК БанковскаяВыписка
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БТ_ЗаявкаНаРасходДС.Остатки(
		|				&ТекДата,
		|				(ДоговорКонтрагента, ЗаявкаНаРасходДС, Организация, СтатьяДДС) В
		|						(ВЫБРАТЬ
		|							БанковскаяВыписка.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		|							БанковскаяВыписка.ДокументПланирования КАК ДокументПланирования,
		|							БанковскаяВыписка.Организация КАК Организация,
		|							БанковскаяВыписка.СтатьяДДС КАК СтатьяДДС
		|						ИЗ
		|							БанковскаяВыписка КАК БанковскаяВыписка)
		//|					И НЕ ЗаявкаНаРасходДС.ВнеПлана                       //Аляль 10.01.2024г.
		|) КАК БТ_ЗаявкаНаРасходДСОстатки
		|		ПО (БТ_ЗаявкаНаРасходДСОстатки.Организация = БанковскаяВыписка.Организация)
		|			И БанковскаяВыписка.ДоговорВзаиморасчетов = БТ_ЗаявкаНаРасходДСОстатки.ДоговорКонтрагента
		|			И БанковскаяВыписка.СтатьяДДС = БТ_ЗаявкаНаРасходДСОстатки.СтатьяДДС
		|			И БанковскаяВыписка.ДокументПланирования = БТ_ЗаявкаНаРасходДСОстатки.ЗаявкаНаРасходДС
		|ГДЕ
		|	ЕСТЬNULL(БТ_ЗаявкаНаРасходДСОстатки.СуммаОстаток, 0) < БанковскаяВыписка.СуммаРасход";
	
	//Запрос.УстановитьПараметр("ТекДата", 	Дата);  
	Запрос.УстановитьПараметр("ТекДата", 	ТекущаяДата());  //Аляль 10.01.2024г. исправлено на ТекДату
	Запрос.УстановитьПараметр("Ссылка", 	Выписка);
	РезультатЗапроса = Запрос.Выполнить();   
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Сообщить("Сумма документа превышает остаток по заявке на расход ДС");
	
	Пока Выборка.Следующий() Цикл
		Сообщить(СтрШаблон("Сумма документа превышает остаток по заявке на расход ДС
			| Заявка на расход: %1
			| Организация: %2
			| Статья ДДС: %3
			| Договор контрагента: %4
			| Проведение документа отменено", 
		Выборка.ДокументПланирования, Выборка.Организация, Выборка.СтатьяДДС, Выборка.ДоговорВзаиморасчетов));
	КонецЦикла;                                   
	
	Возврат 0;

КонецФункции 

Функция ПроверитьОстаток(ЗаявкаНаРасходДС, СтатьяДДС, ДоговорВзаиморасчетов, Организация, Дата)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БТ_ЗаявкаНаРасходДСОстатки.СуммаОстаток КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.БТ_ЗаявкаНаРасходДС.Остатки(
		|			&ТекДата,
		|			ДоговорКонтрагента = &ДоговорКонтрагента
		|				И ЗаявкаНаРасходДС = &ЗаявкаНаРасходДС
		|				И Организация = &Организация
		|				И СтатьяДДС = &СтатьяДДС) КАК БТ_ЗаявкаНаРасходДСОстатки";
	
	Запрос.УстановитьПараметр("ДоговорКонтрагента", ДоговорВзаиморасчетов);
	Запрос.УстановитьПараметр("ЗаявкаНаРасходДС", 	ЗаявкаНаРасходДС);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("СтатьяДДС", 			СтатьяДДС);
	Запрос.УстановитьПараметр("ТекДата", 			Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.СуммаОстаток;
	КонецЦикла;                                   
	
	Возврат 0;

КонецФункции // ПроверитьОстаток(Источник.ДокументПланирования, Источник.СтатьяДДС, Источник.ДоговорВзаиморасчетов, Источник.Организация)()

Функция ХватаетНаОстатке(ДокументОбъект) 

	Если Ложь Тогда
		
		ДокументОбъект = Документы.ЗаявкаНаРасходДС.СоздатьДокумент();
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаРасходДС.СтатьяДДС КАК СтатьяДДС,
		|	ЗаявкаНаРасходДС.Организация КАК Организация,
		|	СУММА(ЗаявкаНаРасходДС.СуммаДокумента) КАК СуммаДокумента,
		|	ЗаявкаНаРасходДС.ПодразделениеКомпании КАК ПодразделениеКомпании
		|ПОМЕСТИТЬ ЗаявкаНаРасходДС
		|ИЗ
		|	Документ.ЗаявкаНаРасходДС КАК ЗаявкаНаРасходДС
		|ГДЕ
		|	ЗаявкаНаРасходДС.Организация = &Организация
		|	И ЗаявкаНаРасходДС.СтатьяДДС = &СтатьяДДС
		|	И НЕ ЗаявкаНаРасходДС.ВнеПлана
		|	И ЗаявкаНаРасходДС.ПодразделениеКомпании = &ПодразделениеКомпании
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаявкаНаРасходДС.СтатьяДДС,
		|	ЗаявкаНаРасходДС.Организация,
		|	ЗаявкаНаРасходДС.ПодразделениеКомпании
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(БТ_ПланДДСОбороты.СуммаОборот, 0) КАК СуммаПоБюджету,
		|	ЗаявкаНаРасходДС.СуммаДокумента КАК СуммаПоЗаявке
		|ИЗ
		|	ЗаявкаНаРасходДС КАК ЗаявкаНаРасходДС
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БТ_ПланДДС.Обороты(
		|				,
		|				,
		|				,
		|				(Организация, СтатьяДДС, ПодразделениеКомпании) В
		|					(ВЫБРАТЬ
		|						ЗаявкаНаРасходДС.Организация КАК Организация,
		|						ЗаявкаНаРасходДС.СтатьяДДС КАК СтатьяДДС,
		|						ЗаявкаНаРасходДС.ПодразделениеКомпании КАК ПодразделениеКомпании
		|					ИЗ
		|						ЗаявкаНаРасходДС КАК ЗаявкаНаРасходДС)) КАК БТ_ПланДДСОбороты
		|		ПО (БТ_ПланДДСОбороты.СтатьяДДС = ЗаявкаНаРасходДС.СтатьяДДС)
		|			И ЗаявкаНаРасходДС.Организация = БТ_ПланДДСОбороты.Организация
		|ГДЕ
		|	ЕСТЬNULL(БТ_ПланДДСОбороты.СуммаОборот, 0) < ЗаявкаНаРасходДС.СуммаДокумента";
	
	Запрос.УстановитьПараметр("Организация", 			ДокументОбъект.Организация);
	Запрос.УстановитьПараметр("СтатьяДДС", 				ДокументОбъект.СтатьяДДС);
	Запрос.УстановитьПараметр("ПодразделениеКомпании", 	ДокументОбъект.ПодразделениеКомпании);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл   
		
		Сообщить(СтрШаблон("Сумма по остатку по бюджету: %1, превышает сумму в заявке: %2", 
			ВыборкаДетальныеЗаписи.СуммаПоБюджету, ВыборкаДетальныеЗаписи.СуммаПоЗаявке));
		
	КонецЦикла;
	
	Возврат Ложь;
	
	
КонецФункции

Процедура БТ_ЗаявкаНаРасходДСОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт 
	
	Если Отказ или не РегистрыСведений.БТ_КонстантныеЗначения.ПолучитьЗначение("ВключитьПлатежныйКалендарь") = Истина Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Движения = Источник.Движения; 
	
	Если Ложь Тогда
		
		Источник = Документы.ЗаявкаНаРасходДС.СоздатьДокумент();
		
	КонецЕсли;	    
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаявкаНаРасходДС") Тогда
		
		Если БылиПодченныеДокументы(Источник.Ссылка) и не СтатусСотрудникаЦФО(Источник.Ссылка) Тогда
			
			//Отказ = Истина;
			//Сообщить("Существуют проведенные подчинённые документы, изменение данных запрещено!");
			//Возврат;                                          
			
		//ИначеЕсли не Источник.ВнеПлана и не ХватаетНаОстатке(Источник) Тогда
		//	
		//	Отказ = Истина;
		//	Возврат;   
			
		КонецЕсли;
		
		Движения.БТ_ЗаявкаНаРасходДС.Очистить();
		Движение = Движения.БТ_ЗаявкаНаРасходДС.Добавить();
		Движение.ВидДвижения 		= ВидДвиженияНакопления.Приход;
		Движение.Период 			= Источник.Дата;
		Движение.Организация 		= Источник.Организация;
		Движение.СтатьяДДС 			= Источник.СтатьяДДС;
		Движение.ДоговорКонтрагента = Источник.ДоговорВзаиморасчетов;
		Движение.Сумма 				= Источник.СуммаДокумента;
		Движение.ЗаявкаНаРасходДС 	= Источник.Ссылка;          
		
	
		Если не Отказ и не СтатьяДДСИзСпискаИсключений(Источник.СтатьяДДС) и не СтатусСотрудникаЦФО(Источник.Ссылка) Тогда
			
			//<<ЧалапАю БизТех 11.01.2024
			Запрос = Новый Запрос("ВЫБРАТЬ
			                      |	БТ_СогласованиеЗаявокДДС.Ссылка КАК Ссылка
			                      |ИЗ
			                      |	БизнесПроцесс.БТ_СогласованиеЗаявокДДС КАК БТ_СогласованиеЗаявокДДС
			                      |ГДЕ
			                      |	БТ_СогласованиеЗаявокДДС.ЗаявкаНаРасходДС = &ЗаявкаНаРасходДС");
			запрос.УстановитьПараметр("ЗаявкаНаРасходДС",Источник.Ссылка);
			Результат = Запрос.Выполнить().Выгрузить();
			Если Результат.Количество() = 0 тогда   
			//ЧалапАю БизТех 11.01.2024 >>
				СоздатьНовыйБП(Источник.Ссылка);  
		    КонецЕсли;
		КонецЕсли;
		
		Если Ложь Тогда
			
			Источник = Документы.РасходныйКассовыйОрдер.СоздатьДокумент();
			
		КонецЕсли;		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.РасходныйКассовыйОрдер") и не Источник.ДокументПланирования.Пустая() Тогда
		
		Если  ПроверитьОстаток(Источник.ДокументПланирования, Источник.СтатьяДДС, Источник.ДоговорВзаиморасчетов, Источник.Организация, Источник.Дата) < Источник.СуммаДокумента Тогда
			
			Отказ = Истина;
			Сообщить(СтрШаблон("Сумма документа превышает остаток по заявке на расход ДС
			| Заявка на расход: %1
			| Организация: %2
			| Статья ДДС: %3
			| Договор контрагента: %4
			| Проведение документа отменено",
			Источник.ДокументПланирования, Источник.Организация, Источник.СтатьяДДС, Источник.ДоговорВзаиморасчетов));
			Возврат;
						
		КонецЕсли;
		
		Движения.БТ_ЗаявкаНаРасходДС.Очистить();
		Движение = Движения.БТ_ЗаявкаНаРасходДС.Добавить();
		Движение.ВидДвижения 		= ВидДвиженияНакопления.Расход;
		Движение.Период 			= Источник.Дата;
		Движение.Организация 		= Источник.Организация;
		Движение.СтатьяДДС 			= Источник.СтатьяДДС;
		Движение.ДоговорКонтрагента = Источник.ДоговорВзаиморасчетов;
		Движение.Сумма 				= Источник.СуммаДокумента;
		Движение.ЗаявкаНаРасходДС	= Источник.ДокументПланирования;  
		
		Если Ложь Тогда
			
			Источник = Документы.Выписка.СоздатьДокумент();
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.Выписка")  Тогда
		
		Движения.БТ_ЗаявкаНаРасходДС.Очистить();    
		//Аляль 11.01.2024г. временно отключено <<
		
		//Если Не ПроверитьОстатокПоВыписке(Источник.Ссылка, Источник.Дата) Тогда
		//	
		//	Отказ = Истина;
		//	Сообщить("Проведение документа отменено");
		//	Возврат;
		//	
		//КонецЕсли;   
		// >>
			
		
		Для каждого ТекСостав из Источник.Состав Цикл
		
			Движение = Движения.БТ_ЗаявкаНаРасходДС.Добавить();
			Движение.ВидДвижения 		= ВидДвиженияНакопления.Расход;
			Движение.Период 			= Источник.Дата;
			Движение.Организация 		= Источник.Организация;
			Движение.СтатьяДДС 			= ТекСостав.СтатьяДДС;
			Движение.ДоговорКонтрагента = ТекСостав.ДоговорВзаиморасчетов;
			Движение.Сумма 				= ТекСостав.СуммаРасход;
			Движение.ЗаявкаНаРасходДС	= ТекСостав.ДокументПланирования;
			
		КонецЦикла;
    КонецЕсли;
КонецПроцедуры

Процедура БТ_ВыполнениеЗаявкиОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если не Отказ Тогда
		
		Основание = новый СписокЗначений;
		
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.РасходныйКассовыйОрдер") и не Источник.ДокументПланирования.Пустая() Тогда
		
		Основание.Добавить(Источник.ДокументПланирования);  
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.Выписка")  Тогда

		Для каждого ТекСостав из Источник.Состав Цикл

			Основание.Добавить(ТекСостав.ДокументПланирования);
			
		КонецЦикла;
		
	КонецЕсли;	
	Источник.Движения.Записать();
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ПлатежныйКалендарьОбороты.РасходФактОборот - ПлатежныйКалендарьОбороты.РасходОборот КАК Остаток,
	//	|	ПлатежныйКалендарьОбороты.ДокументПланирования КАК ДокументПланирования
	//	|ПОМЕСТИТЬ ОстатокПриПроведении
	//	|ИЗ
	//	|	РегистрНакопления.ПлатежныйКалендарь.Обороты(, , , ДокументПланирования в (&ЗаявкаНаРасходДС)) КАК ПлатежныйКалендарьОбороты
	//	|;
	//	|
	//	|////////////////////////////////////////////////////////////////////////////////
	//	|ВЫБРАТЬ ПЕРВЫЕ 1
	//	|	БТ_СогласованиеЗаявокДДС.Ссылка КАК Ссылка,
	//	|	БТ_СтатусыЗаявокПоСтрокамСрезПоследних.Статус КАК Статус,
	//	|	БТ_СогласованиеЗаявокДДС.Завершен КАК Завершен,
	//	|	БТ_СогласованиеЗаявокДДС.Отменен КАК Отменен,
	//	|	БТ_СогласованиеЗаявокДДС.ЗаявкаНаРасходДС КАК ЗаявкаНаРасходДС,
	//	|	ОстатокПриПроведении.Остаток КАК Остаток,
	//	|	БТ_СогласованиеЗаявокДДС.ЗаявкаНаРасходДС.СтатусТТ КАК ЗаявкаНаРасходДССтатусТТ
	//	|ИЗ
	//	|	БизнесПроцесс.БТ_СогласованиеЗаявокДДС КАК БТ_СогласованиеЗаявокДДС
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.БТ_СтатусыЗаявокПоСтрокам.СрезПоследних КАК БТ_СтатусыЗаявокПоСтрокамСрезПоследних
	//	|		ПО (БТ_СтатусыЗаявокПоСтрокамСрезПоследних.ЗаявкаПользователя = БТ_СогласованиеЗаявокДДС.Ссылка)
	//	|		ЛЕВОЕ СОЕДИНЕНИЕ ОстатокПриПроведении КАК ОстатокПриПроведении
	//	|		ПО БТ_СогласованиеЗаявокДДС.ЗаявкаНаРасходДС = ОстатокПриПроведении.ДокументПланирования
	//	|ГДЕ
	//	|	БТ_СогласованиеЗаявокДДС.ЗаявкаНаРасходДС В(&ЗаявкаНаРасходДС)
	//	|	И НЕ БТ_СогласованиеЗаявокДДС.Завершен
	//	|
	//	|УПОРЯДОЧИТЬ ПО
	//	|	Ссылка УБЫВ
	//	|АВТОУПОРЯДОЧИВАНИЕ";
	//
	//Запрос.УстановитьПараметр("ЗаявкаНаРасходДС", Основание);
	//
	//Выборка = Запрос.Выполнить().Выбрать();
	//
	//Пока Выборка.Следующий() Цикл
	//	
	//	Если Выборка.Отменен Тогда
	//		
	//		Сообщить(СтрШаблон("По документу: %1, Отменено согласование БП", Выборка.ЗаявкаНаРасходДС));
	//		Отказ = Истина;
	//		
	//	ИначеЕсли Выборка.Завершен Тогда
	//		
	//	ИначеЕсли не Выборка.Статус = Перечисления.БТ_СтатусыЗаявок.Утверждена и
	//		не Выборка.Статус = Перечисления.БТ_СтатусыЗаявок.УтвержденаКазначеня Тогда
	//		
	//		Сообщить(СтрШаблон("По документу: %1, не прошло согласование, статус должен быть Утверждена!", Выборка.ЗаявкаНаРасходДС));
	//		Отказ = Истина;
	//		
	//	//Иначе
	//	//	
	//	//	БТ_БизнесПроцессы.СогласоватьЗаявку(Выборка.Ссылка);
	//		//Оповестить("ОбновитьФорму");
	//		
	//	КонецЕсли;      
		
		//БизТех 26.01.2024г. ошибка была по статусу
		//Если не Отказ и Выборка.Остаток = 0 и Выборка.ЗаявкаНаРасходДССтатусТТ <> Перечисления.ТТ_СтатусыЗаявкиНаРасходДС.Оплачена Тогда 
		//Если не Отказ и Выборка.Остаток = 0 Тогда
		//	
		//	ЗаявкаНаРасходДС = Выборка.ЗаявкаНаРасходДС;
		//	
		//	Если Ложь Тогда
		//		
		//		ЗаявкаНаРасходДС = Документы.ЗаявкаНаРасходДС.ПустаяСсылка();
		//		
		//	КонецЕсли;   
		//	
		//	РегистрыСведений.БТ_СтатусыЗаявкиДДС.УстановитьСтатус(ЗаявкаНаРасходДС, Перечисления.ТТ_СтатусыЗаявкиНаРасходДС.Оплачена);
			
			//Об = ЗаявкаНаРасходДС.ПолучитьОбъект();
			//Об.СтатусТТ = Перечисления.ТТ_СтатусыЗаявкиНаРасходДС.Оплачена;
			//Об.Записать();
			
		//КонецЕсли;
		
	//КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

		
	КонецЕсли;
	
КонецПроцедуры

Функция ПроверитьОстатокПередЗапись(ДокументОбъект)  
	
	Если Ложь Тогда
		
		ДокументОбъект = Документы.ЗаявкаНаРасходДС.СоздатьДокумент();
		
	КонецЕсли;
	
	Запрос = Новый Запрос;     
	
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаявкаНаРасходДС.СтатьяДДС КАК СтатьяДДС,
		|	ЗаявкаНаРасходДС.Организация КАК Организация,
		|	СУММА(ЗаявкаНаРасходДС.СуммаДокумента) КАК СуммаДокумента,
		|	ЗаявкаНаРасходДС.ПодразделениеКомпании КАК ПодразделениеКомпании
		|ПОМЕСТИТЬ ЗаявкаНаРасходДС
		|ИЗ
		|	Документ.ЗаявкаНаРасходДС КАК ЗаявкаНаРасходДС
		|ГДЕ
		|	ЗаявкаНаРасходДС.Организация = &Организация
		|	И ЗаявкаНаРасходДС.СтатьяДДС = &СтатьяДДС
		|	И НЕ ЗаявкаНаРасходДС.ВнеПлана
		|	И ЗаявкаНаРасходДС.Ссылка <> &Ссылка
		|	И &ВсеДокументы
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаявкаНаРасходДС.СтатьяДДС,
		|	ЗаявкаНаРасходДС.Организация,
		|	ЗаявкаНаРасходДС.ПодразделениеКомпании
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&СтатьяДДС,
		|	&Организация,
		|	СУММА(&СуммаДокумента),
		|	&ПодразделениеКомпании
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаявкаНаРасходДС.СтатьяДДС КАК СтатьяДДС,
		|	ЗаявкаНаРасходДС.Организация КАК Организация,
		|	СУММА(ЗаявкаНаРасходДС.СуммаДокумента) КАК СуммаДокумента,
		|	ЗаявкаНаРасходДС.ПодразделениеКомпании КАК ПодразделениеКомпании
		|ПОМЕСТИТЬ ЗаявкаНаРасходДССумма
		|ИЗ
		|	ЗаявкаНаРасходДС КАК ЗаявкаНаРасходДС
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаявкаНаРасходДС.Организация,
		|	ЗаявкаНаРасходДС.СтатьяДДС,
		|	ЗаявкаНаРасходДС.ПодразделениеКомпании
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(БТ_ПланДДСОбороты.СуммаОборот, 0) КАК СуммаПоБюджету,
		|	ЗаявкаНаРасходДССумма.СуммаДокумента КАК СуммаПоЗаявке
		|ИЗ
		|	ЗаявкаНаРасходДССумма КАК ЗаявкаНаРасходДССумма
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.БТ_ПланДДС.Обороты(
		|				,
		|				,
		|				,
		|				(Организация, СтатьяДДС, ПодразделениеКомпании) В
		|					(ВЫБРАТЬ
		|						ЗаявкаНаРасходДС.Организация КАК Организация,
		|						ЗаявкаНаРасходДС.СтатьяДДС КАК СтатьяДДС,
		|						ЗаявкаНаРасходДС.ПодразделениеКомпании КАК ПодразделениеКомпании
		|					ИЗ
		|						ЗаявкаНаРасходДС КАК ЗаявкаНаРасходДС)) КАК БТ_ПланДДСОбороты
		|		ПО (БТ_ПланДДСОбороты.СтатьяДДС = ЗаявкаНаРасходДССумма.СтатьяДДС)
		|			И ЗаявкаНаРасходДССумма.Организация = БТ_ПланДДСОбороты.Организация
		|			И ЗаявкаНаРасходДССумма.ПодразделениеКомпании = БТ_ПланДДСОбороты.ПодразделениеКомпании
		|ГДЕ
		|	ЕСТЬNULL(БТ_ПланДДСОбороты.СуммаОборот, 0) < ЗаявкаНаРасходДССумма.СуммаДокумента";
	
	Запрос.УстановитьПараметр("Организация", 			ДокументОбъект.Организация);
	Запрос.УстановитьПараметр("СтатьяДДС", 				ДокументОбъект.СтатьяДДС);
	Запрос.УстановитьПараметр("СуммаДокумента", 		ДокументОбъект.СуммаДокумента);   
	Запрос.УстановитьПараметр("ПодразделениеКомпании", 	ДокументОбъект.ПодразделениеКомпании);
	Запрос.УстановитьПараметр("Ссылка", 				ДокументОбъект.Ссылка);         
	Запрос.УстановитьПараметр("ВсеДокументы", 			РегистрыСведений.БТ_КонстантныеЗначения.ПолучитьЗначение("ПроверятьВсеДокументыПриЗаписиЗаявкиНаРасход") = Истина);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		Возврат Истина;
		
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл   
		
		Сообщить(СтрШаблон("Сумма по остатку по бюджету: %1, превышает сумму в заявке: %2", 
			ВыборкаДетальныеЗаписи.СуммаПоБюджету, ВыборкаДетальныеЗаписи.СуммаПоЗаявке));
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

Процедура БТ_ПередЗаписьюПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Отказ или не РегистрыСведений.БТ_КонстантныеЗначения.ПолучитьЗначение("ВключитьПлатежныйКалендарь") = Истина Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаявкаНаРасходДС") Тогда
		
		Если Ложь Тогда
			
			Источник = Документы.ЗаявкаНаРасходДС.СоздатьДокумент();
			
		КонецЕсли;
		
		Если не Источник.ВнеПлана и не ПроверитьОстатокПередЗапись(Источник) Тогда
			
			#Если Клиент Тогда
			
				Если Вопрос("Не хватает остатка по Плану ДДС, установить флаг «Внеплановая»?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Да Тогда
					
					Источник.ВнеПлана = Истина;
					
				Иначе
					
					Отказ = Истина;
					
				КонецЕсли;         
				
			#Иначе
				
				Отказ = Истина;
				
			#КонецЕсли
			
				
		КонецЕсли;
			
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") и Источник.ДокументПланирования.Пустая() Тогда		
		
		Отказ = Истина;
		Сообщить("Не указан документ Планирования");
			
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументСсылка.Выписка")  Тогда
		
		Для каждого ТекСостав из Источник.Состав Цикл 
			
			Если ТекСостав.ДокументПланирования = Неопределено
				или Не ЗначениеЗаполнено(ТекСостав.ДокументПланирования) 
				или ТипЗнч(ТекСостав.ДокументПланирования) = Тип("ДокументСсылка.ЗаявкаНаРасходДС") Тогда
				
				Отказ = Истина;
				Сообщить("Не указан документ Планирования");
				Прервать;
				
			КонецЕсли;
			
		КонецЦикла;
				
	
	КонецЕсли;
	// Вставить содержимое обработчика.
КонецПроцедуры

Функция СтатьяДДСИзСпискаИсключений(Статья)
	
	Запрос = Новый Запрос ("ВЫБРАТЬ ПЕРВЫЕ 1
	                       |	ИСТИНА КАК Поле1
	                       |ИЗ
	                       |	РегистрСведений.БТ_СтатьиДДСИсключения КАК БТ_СтатьиДДСИсключения
	                       |ГДЕ
	                       |	БТ_СтатьиДДСИсключения.СтатьяДДС = &СтатьяДДС");   
	
	Запрос.УстановитьПараметр("СтатьяДДС", Статья);    
	Выборка = Запрос.Выполнить();
	
	Возврат не Выборка.Пустой();

КонецФункции

Процедура РассчитатьЛимиты(Заявка) Экспорт
	//расчет плана ДДС + приход по РН Заявка на расход ДС
КонецПроцедуры  
//Задача 00000001337 от 26.05.2022 14:35:04
Процедура БТ_СозданиеЗаявкиНАРасходДС(Источник, Отказ, РежимПроведения) Экспорт
	Если не Отказ тогда
		Для Каждого ТекСтрокаАвтомобили Из Источник.Автомобили Цикл
			//Ввод заявки на расход	
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ЗаявкаНаРасходДС.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ЗаявкаНаРасходДС.Автомобили КАК ЗаявкаНаРасходДСАвтомобили
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРасходДС КАК ЗаявкаНаРасходДС
			|		ПО ЗаявкаНаРасходДСАвтомобили.Ссылка = ЗаявкаНаРасходДС.Ссылка
			|ГДЕ
			|	ЗаявкаНаРасходДС.ПометкаУдаления = ЛОЖЬ
			|	И ЗаявкаНаРасходДС.ДокументОснование = &ДокументОснование
			|	И ЗаявкаНаРасходДСАвтомобили.Автомобиль = &Автомобиль";
			
			Запрос.УстановитьПараметр("ДокументОснование", Источник.Ссылка);
			Запрос.УстановитьПараметр("Автомобиль", ТекСтрокаАвтомобили.Автомобиль);
			
			РезультатЗапроса = Запрос.Выполнить();
			Если РезультатЗапроса.Пустой() Тогда				
				Если ТипЗнч(Источник.Ссылка)=Тип("ДокументСсылка.ПоступлениеАвтомобилей") 
					И Источник.СкладКомпании.БТ_ВидСкладаАвто = Перечисления.БТ_ВидыСкладовАвто.ОХ Тогда  
						//Временно не создаем Заявку на расход ДС при проведении док. Поступление на ответ хранение
						//СоздатьЗаявкуНаРасходДС(Источник, Источник.ДоговорВзаиморасчетов, ТекСтрокаАвтомобили.Автомобиль);
				ИначеЕсли ТипЗнч(Источник.Ссылка)=Тип("ДокументСсылка.ПеремещениеАвтомобилей")
						И Источник.СкладПолучатель.БТ_ВидСкладаАвто = Перечисления.БТ_ВидыСкладовАвто.Выкуп
						И (Источник.СкладКомпании.БТ_ВидСкладаАвто = Перечисления.БТ_ВидыСкладовАвто.Лизинг 
							ИЛИ Источник.СкладКомпании.БТ_ВидСкладаАвто = Перечисления.БТ_ВидыСкладовАвто.Факторинг) Тогда
							Договор = НайтиКонтрагентаИДоговорПоСкладу(Источник.СкладКомпании, Источник.Дата); 
							Если Договор <> Неопределено Тогда
								СоздатьЗаявкуНаРасходДС(Источник, Договор, ТекСтрокаАвтомобили.Автомобиль);
							Иначе
								Сообщить("Не определен Контрагент, которому необходимо оформить оплату. Документ Заявка на расход ДС не создан!");
							КонецЕсли; 
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;	
КонецПроцедуры   

Процедура СоздатьЗаявкуНаРасходДС(Источник, ДоговорВзаиморасчетов, Авто)
	Док=Документы.ЗаявкаНаРасходДС.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(Док, Источник);
	Док.ОбработкаРеквизита("Организация");
	Док.СтруктурнаяЕдиница=Док.Организация.ОсновнойБанковскийСчет;  
	Док.ОбработкаРеквизита("ДоговорВзаиморасчетов");   
	Если Не ЗначениеЗаполнено(Док.ДоговорВзаиморасчетов) Тогда
		Док.Контрагент = ДоговорВзаиморасчетов.Владелец;  
		Док.ДоговорВзаиморасчетов = ДоговорВзаиморасчетов;
	КонецЕсли;
	Док.СчетКонтрагента=Док.Контрагент.ОсновнойБанковскийСчет;
	Док.Комментарий=Авто.VIN;
	Бренд=ТТ_Общий.ПолучитьБрэнд(Авто.Модель);
	Док.СтатьяДДС=Справочники.СтатьиДДС.НайтиПоНаименованию("Автомобили "+Бренд,,Справочники.СтатьиДДС.НайтиПоКоду("ЦБ0000115")); //Покупка товарных авто
	Если Док.СтатьяДДС.Пустая() тогда
		Док.СтатьяДДС=Справочники.СтатьиДДС.НайтиПоКоду("ЦБ0000129");  //сваливаем в прочие авто
	КонецЕсли;
	Док.СтатусТТ=Перечисления.ТТ_СтатусыЗаявкиНаРасходДС.Заявка;
	Док.ДатаСоздания=Источник.Дата;
	Док.ДатаПлатежа=Док.ДатаСоздания+24*3600;
	Док.Дата=Док.ДатаПлатежа;
	Док.ДокументОснование=Источник.Ссылка;
	Док.ХозОперация=Справочники.ХозОперации.ЗаявкаНаРасходСРС;
	
	СтрокаПлатежа=Док.Платежи.Добавить();
	СтрокаПлатежа.Описание="Создано автоматически. Проверьте расчетные счета и договор!";
	СтрокаПлатежа.ДатаПлатежа=Док.ДатаПлатежа;  
	Если ТипЗНЧ(Источник.Ссылка)= Тип("ДокументСсылка.ПеремещениеАвтомобилей") Тогда 
		//Необходимо найти Поступление авто  
		Запрос = Новый Запрос;
		Запрос.Текст = 
		     "ВЫБРАТЬ
		     |	ОстаткиАвтомобилей.Партия КАК Партия,
		     |	ОстаткиАвтомобилей.СуммаНДС КАК СуммаНДС,
		     |	ОстаткиАвтомобилей.СтавкаНДС КАК СтавкаНДС,
		     |	ОстаткиАвтомобилей.Сумма КАК Сумма
		     |ИЗ
		     |	РегистрНакопления.ОстаткиАвтомобилей КАК ОстаткиАвтомобилей
		     |ГДЕ
		     |	ОстаткиАвтомобилей.Автомобиль = &Автомобиль
		     |	И ОстаткиАвтомобилей.Период <= &ДатаДок
		     |	И ОстаткиАвтомобилей.СтатусПартии = &СтатусПартии
		     |	И (ОстаткиАвтомобилей.ХозОперация = &ХозОперация ИЛИ ОстаткиАвтомобилей.ХозОперация = &ХозОперацияСобственность)";
		Запрос.УстановитьПараметр("ХозОперация", Справочники.ХозОперации.ПоступлениеАвтомобилей);  
		Запрос.УстановитьПараметр("ХозОперацияСобственность", Справочники.ХозОперации.ПереходВСобственностьАвтомобилей);
		Запрос.УстановитьПараметр("СтатусПартии", Перечисления.СтатусыПартий.ТоварКупленный);
		Запрос.УстановитьПараметр("ДатаДок", Источник.Дата);
		Запрос.УстановитьПараметр("Автомобиль", Авто);
		Результат = Запрос.Выполнить().Выгрузить();  
		Если Не Результат.Количество() = 0 Тогда
			СтрокаПлатежа.Сумма = Результат[0].Сумма;
			СтрокаПлатежа.СтавкаНДС = Результат[0].СтавкаНДС;
			СтрокаПлатежа.СуммаНДС = Результат[0].СуммаНДС; 
		Иначе 
			Сообщить("Не найден документ Поступление для автомобиля! Заявка на расход ДС не создана!");
			Возврат; 
		КонецЕсли;
	Иначе
		СтрокаОснования=Источник.Ссылка.Автомобили.Найти(Авто,"Автомобиль");  
		Если СтрокаОснования=Неопределено Тогда Возврат; КонецЕсли;    		
		СтрокаПлатежа.СтавкаНДС=СтрокаОснования.СтавкаНДС;
		СтрокаПлатежа.Сумма=СтрокаОснования.СуммаВсего;
		СтрокаПлатежа.СуммаНДС=СтрокаОснования.СуммаНДС;
	КонецЕсли;
	
	СтрокаАвто=Док.Автомобили.Добавить();
	СтрокаАвто.Автомобиль=Авто;
	СтрокаАвто.СуммаОплаты=СтрокаПлатежа.Сумма;
	
	 
	Док.УстановитьНовыйНомер();
	Док.Записать();
	Сообщить("Автоматически создана "+Док);

	
	//---Бренд---
	Бренд=ТТ_Общий.ПолучитьБрэнд(Авто.Модель);
	
	РС=РегистрыСведений.ЗначенияСвойствОбъектов.СоздатьМенеджерЗаписи();
	РС.Объект=Док.Ссылка;
	РС.Свойство=ПланыВидовХарактеристик.СвойстваОбъектов.НайтиПоНаименованию("ЦФОБренд");
	
	Значение=Справочники.ЗначенияСвойств.НайтиПоНаименованию(Бренд,,,РС.Свойство);
	
	Если НЕ Значение.Пустая() Тогда
		РС.Значение=Значение;
	Иначе
		РС.Значение=Справочники.ЗначенияСвойств.НайтиПоНаименованию("Общие затраты",,,РС.Свойство);
	КонецЕсли;
	
	РС.Записать();
КонецПроцедуры  

Функция НайтиКонтрагентаИДоговорПоСкладу(Склад, ДатаДокумента) 
	Запрос = Новый запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	БТ_СоответствиеКонтрагентовИСкладовСрезПоследних.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов
	                |ИЗ
	                |	РегистрСведений.БТ_СоответствиеКонтрагентовИСкладов.СрезПоследних(&ДатаДок, Склад = &Склад) КАК БТ_СоответствиеКонтрагентовИСкладовСрезПоследних";
	Запрос.УстановитьПараметр("ДатаДок", ДатаДокумента);
	Запрос.УстановитьПараметр("Склад", Склад);
	Результат = Запрос.Выполнить();  
	Если Результат.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		Возврат Выборка.ДоговорВзаиморасчетов;
	КонецЦикла;
			
КонецФункции

Функция ПроверитьПоследнуюЗапись(Документ)  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	БТ_ИзмененныеДокументыДляПереносаВБПСрезПоследних.Период КАК Период
		|ИЗ
		|	РегистрСведений.БТ_ИзмененныеДокументыДляПереносаВБП.СрезПоследних(, Документ = &Документ) КАК БТ_ИзмененныеДокументыДляПереносаВБПСрезПоследних
		|ГДЕ
		|	БТ_ИзмененныеДокументыДляПереносаВБПСрезПоследних.ДатаЗагрузкиВБП = ДАТАВРЕМЯ(1, 1, 1)";
	
	Запрос.УстановитьПараметр("Документ", Документ);  
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Пустой();
	
КонецФункции

Процедура ПодпискаНаСобытие1ПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если ПроверитьПоследнуюЗапись(Источник.ссылка) и Источник.Дата < НачалоДня(ТекущаяДата()) Тогда  
		Если НЕ (Источник.Метаданные().Имя = "ЗаказНаряд" и Источник.Состояние <> Справочники.ВидыСостоянийЗаказНарядов.Закрыт) Тогда 
	
			МенеджерЗаписи = РегистрыСведений.БТ_ИзмененныеДокументыДляПереносаВБП.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.Период 			= ТекущаяДата();
			МенеджерЗаписи.Документ			= Источник.ссылка;
			МенеджерЗаписи.Ответственный	= ПараметрыСеанса.Пользователь; 
			МенеджерЗаписи.ВидДокумента 	= Источник.Метаданные().Имя;
			МенеджерЗаписи.Записать(); 
			
	    КонецЕсли;
	КонецЕсли;
			
КонецПроцедуры
